In [8]:
import pandas as pd

In [9]:
d={"key1":[3,4,5,6,7],
    "key2":[2,4,5,6,9],
    "key3":[3,76,8,9,6]   
}

In [10]:
df = pd.DataFrame(d)

In [11]:
df

   key1  key2  key3
0     3     2     3
1     4     4    76
2     5     5     8
3     6     6     9
4     7     9     6

In [12]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]}

In [13]:

df = pd.DataFrame(data1,index=['a', 'b', 'c', 'd'])

In [16]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [11]:
df.reindex(['b', 'c', 'd', 'a'])

     Name  Age    Address Qualification  Mobile No
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76
a     Jai   27     Nagpur           Msc         97

In [12]:
for i in df.iterrows():
    print(i)

('a', Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object)
('b', Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object)
('c', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object)
('d', Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object)

In [14]:
for i,j in df.iterrows():
    print(j)

Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object
Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object
Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object
Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object

In [15]:
for i in df.iterrows():
    print(i,j)

('a', Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object) Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object
('b', Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object) Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object
('c', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object) Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object
('d', Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object) Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object

In [14]:
allData= []
for i, j in df.iterrows():
    # print(j['Name'])
    oneData = {
        'Name': j['Name'],
        'Age' : j['Age'],
        'Address' : j['Address'],
        'Qualification' : j['Qualification'],
        'Mobile No' : j['Mobile No'],
    }
    allData.append(oneData)

print(allData)

[{'Name': 'Jai', 'Age': 27, 'Address': 'Nagpur', 'Qualification': 'Msc', 'Mobile No': 97}, {'Name': 'Princi', 'Age': 24, 'Address': 'Kanpur', 'Qualification': 'MA', 'Mobile No': 91}, {'Name': 'Gaurav', 'Age': 22, 'Address': 'Allahabad', 'Qualification': 'MCA', 'Mobile No': 58}, {'Name': 'Anuj', 'Age': 32, 'Address': 'Kannuaj', 'Qualification': 'Phd', 'Mobile No': 76}]

In [21]:
for i,j in df.items():
    print(i,j)

Name a       Jai
b    Princi
c    Gaurav
d      Anuj
Name: Name, dtype: object
Age a    27
b    24
c    22
d    32
Name: Age, dtype: int64
Address a       Nagpur
b       Kanpur
c    Allahabad
d      Kannuaj
Name: Address, dtype: object
Qualification a    Msc
b     MA
c    MCA
d    Phd
Name: Qualification, dtype: object
Mobile No a    97
b    91
c    58
d    76
Name: Mobile No, dtype: int64

In [15]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [23]:
list(df["Name"])

['Jai', 'Princi', 'Gaurav', 'Anuj']

In [28]:
age_sum=(df["Age"].sum())

In [29]:
age_sum

105

In [31]:
def test(x):
  return x.sum()
df.apply(test)

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [33]:
df.apply(lambda x: x.sum())

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [37]:
df.columns

Index(['Name', 'Age', 'Address', 'Qualification', 'Mobile No'], dtype='object')

In [40]:
df1=df[["Age","Mobile No"]]

In [41]:
df1

   Age  Mobile No
a   27         97
b   24         91
c   22         58
d   32         76

In [44]:
df1.applymap(lambda x: x**2)

    Age  Mobile No
a   729       9409
b   576       8281
c   484       3364
d  1024       5776

In [16]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [18]:
df.sort_values(by=['Name',"Address"], ascending= False)

     Name  Age    Address Qualification  Mobile No
b  Princi   24     Kanpur            MA         91
a     Jai   27     Nagpur           Msc         97
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [27]:
pd.set_option("display.max_colwidth", 1000)
dfLorem = pd.DataFrame({"test":["Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.i am learining ds inthe i learn te dataframe and also so many mathos in it "]})
dfLorem

                                                                                                                                                                                                                                                                                                                                                                                                                                                        test
0  Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.i am learining ds inthe i learn te dataframe and also so many mathos in it

In [30]:
dfLorem['word_ln'] = dfLorem['test'].apply(lambda x: len(x.split()))

In [32]:
dfLorem

,test,word_ln
0,"Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.i am learining ds inthe i learn te dataframe and also so many mathos in it",75